In [1]:
import pandas as pd 

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [24, 30, 22, 35],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston'],
    'Salary': [70000, 80000, 60000, 90000]
}

df = pd.DataFrame(data)

df

      Name  Age         City  Salary
0    Alice   24     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   22      Chicago   60000
3    David   35      Houston   90000

In [ ]:
filtered_df = df.loc[df['City'].str.contains('C', case=True)]

print("Filtered DataFrame:")
print(filtered_df)

Filtered DataFrame:
      Name  Age         City  Salary
0    Alice   24     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   22      Chicago   60000
3    David   35      Houston   90000